Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_uart.c
/**
 ******************************************************************************
 * @file    bl702_uart.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_uart.h"
#include "bl702_glb.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  UART
 *  @{
 */

/** @defgroup  UART_Private_Macros
 *  @{
 */
#define UART_TX_TIMEOUT_COUNT (160 * 1000)

/*@} end of group UART_Private_Macros */

/** @defgroup  UART_Private_Types
 *  @{
 */

/*@} end of group UART_Private_Types */

/** @defgroup  UART_Private_Variables
 *  @{
 */
static const uint32_t    uartAddr[2]                     = {UART0_BASE, UART1_BASE};
static intCallback_Type *uartIntCbfArra[2][UART_INT_ALL] = {{NULL}, {NULL}};

/*@} end of group UART_Private_Variables */

/** @defgroup  UART_Global_Variables
 *  @{
 */

/*@} end of group UART_Global_Variables */

/** @defgroup  UART_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static void UART_IntHandler(UART_ID_Type uartId);
#endif

/*@} end of group UART_Private_Fun_Declaration */

/** @defgroup  UART_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  UART interrupt common handler function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void UART_IntHandler(UART_ID_Type uartId) {
  uint32_t tmpVal  = 0;
  uint32_t maskVal = 0;
  uint32_t UARTx   = uartAddr[uartId];

  tmpVal  = BL_RD_REG(UARTx, UART_INT_STS);
  maskVal = BL_RD_REG(UARTx, UART_INT_MASK);

  /* Length of uart tx data transfer arrived interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_UTX_END_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_UTX_END_MASK)) {
    BL_WR_REG(UARTx, UART_INT_CLEAR, 0x1);

    if (uartIntCbfArra[uartId][UART_INT_TX_END] != NULL) {
      uartIntCbfArra[uartId][UART_INT_TX_END]();
    }
  }

  /* Length of uart rx data transfer arrived interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_END_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_END_MASK)) {
    BL_WR_REG(UARTx, UART_INT_CLEAR, 0x2);

    if (uartIntCbfArra[uartId][UART_INT_RX_END] != NULL) {
      uartIntCbfArra[uartId][UART_INT_RX_END]();
    }
  }

  /* Tx fifo ready interrupt,auto-cleared when data is pushed */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_UTX_FIFO_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_UTX_FIFO_MASK)) {
    if (uartIntCbfArra[uartId][UART_INT_TX_FIFO_REQ] != NULL) {
      uartIntCbfArra[uartId][UART_INT_TX_FIFO_REQ]();
    }
  }

  /* Rx fifo ready interrupt,auto-cleared when data is popped */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_FIFO_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_FIFO_MASK)) {
    if (uartIntCbfArra[uartId][UART_INT_RX_FIFO_REQ] != NULL) {
      uartIntCbfArra[uartId][UART_INT_RX_FIFO_REQ]();
    }
  }

  /* Rx time-out interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_RTO_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_RTO_MASK)) {
    BL_WR_REG(UARTx, UART_INT_CLEAR, 0x10);

    if (uartIntCbfArra[uartId][UART_INT_RTO] != NULL) {
      uartIntCbfArra[uartId][UART_INT_RTO]();
    }
  }

  /* Rx parity check error interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_PCE_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_PCE_MASK)) {
    BL_WR_REG(UARTx, UART_INT_CLEAR, 0x20);

    if (uartIntCbfArra[uartId][UART_INT_PCE] != NULL) {
      uartIntCbfArra[uartId][UART_INT_PCE]();
    }
  }

  /* Tx fifo overflow/underflow error interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_UTX_FER_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_UTX_FER_MASK)) {
    if (uartIntCbfArra[uartId][UART_INT_TX_FER] != NULL) {
      uartIntCbfArra[uartId][UART_INT_TX_FER]();
    }
  }

  /* Rx fifo overflow/underflow error interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_FER_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_FER_MASK)) {
    if (uartIntCbfArra[uartId][UART_INT_RX_FER] != NULL) {
      uartIntCbfArra[uartId][UART_INT_RX_FER]();
    }
  }

  /* Rx lin mode sync field error interrupt */
  if (BL_IS_REG_BIT_SET(tmpVal, UART_URX_LSE_INT) && !BL_IS_REG_BIT_SET(maskVal, UART_CR_URX_LSE_MASK)) {
    BL_WR_REG(UARTx, UART_INT_CLEAR, 0x100);

