Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_uart.c
    if (uartIntCbfArra[uartId][UART_INT_LSE] != NULL) {
      uartIntCbfArra[uartId][UART_INT_LSE]();
    }
  }
}
#endif

/*@} end of group UART_Private_Functions */

/** @defgroup  UART_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  UART initialization function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  uartCfg: UART configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_Init(UART_ID_Type uartId, UART_CFG_Type *uartCfg) {
  uint32_t tmpValTxCfg     = 0;
  uint32_t tmpValRxCfg     = 0;
  uint32_t fraction        = 0;
  uint32_t baudRateDivisor = 0;
  uint32_t UARTx           = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));
  CHECK_PARAM(IS_UART_PARITY_TYPE(uartCfg->parity));
  CHECK_PARAM(IS_UART_DATABITS_TYPE(uartCfg->dataBits));
  CHECK_PARAM(IS_UART_STOPBITS_TYPE(uartCfg->stopBits));
  CHECK_PARAM(IS_UART_BYTEBITINVERSE_TYPE(uartCfg->byteBitInverse));

  /* Cal the baud rate divisor */
  fraction        = uartCfg->uartClk * 10 / uartCfg->baudRate % 10;
  baudRateDivisor = uartCfg->uartClk / uartCfg->baudRate;

  if (fraction >= 5) {
    ++baudRateDivisor;
  }

  /* Set the baud rate register value */
  BL_WR_REG(UARTx, UART_BIT_PRD, ((baudRateDivisor - 1) << 0x10) | ((baudRateDivisor - 1) & 0xFFFF));

  /* Configure parity type */
  tmpValTxCfg = BL_RD_REG(UARTx, UART_UTX_CONFIG);
  tmpValRxCfg = BL_RD_REG(UARTx, UART_URX_CONFIG);

  switch (uartCfg->parity) {
  case UART_PARITY_NONE:
    tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
    tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
    break;

  case UART_PARITY_ODD:
    tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
    tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_SEL);
    tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
    tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_SEL);
    break;

  case UART_PARITY_EVEN:
    tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_EN);
    tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UTX_PRT_SEL);
    tmpValRxCfg = BL_SET_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_EN);
    tmpValRxCfg = BL_CLR_REG_BIT(tmpValRxCfg, UART_CR_URX_PRT_SEL);
    break;

  default:
    break;
  }

  /* Configure data bits */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_BIT_CNT_D, (uartCfg->dataBits + 4));
  tmpValRxCfg = BL_SET_REG_BITS_VAL(tmpValRxCfg, UART_CR_URX_BIT_CNT_D, (uartCfg->dataBits + 4));

  /* Configure tx stop bits */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_BIT_CNT_P, uartCfg->stopBits);

  /* Configure tx cts flow control function */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_CTS_EN, uartCfg->ctsFlowControl);

  /* Configure rx input de-glitch function */
  tmpValRxCfg = BL_SET_REG_BITS_VAL(tmpValRxCfg, UART_CR_URX_DEG_EN, uartCfg->rxDeglitch);

  /* Configure tx lin mode function */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_LIN_EN, uartCfg->txLinMode);

  /* Configure rx lin mode function */
  tmpValRxCfg = BL_SET_REG_BITS_VAL(tmpValRxCfg, UART_CR_URX_LIN_EN, uartCfg->rxLinMode);

  /* Set tx break bit count for lin protocol */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_BIT_CNT_B, uartCfg->txBreakBitCnt);

  /* Write back */
  BL_WR_REG(UARTx, UART_UTX_CONFIG, tmpValTxCfg);
  BL_WR_REG(UARTx, UART_URX_CONFIG, tmpValRxCfg);

  /* Configure LSB-first or MSB-first */
  tmpValTxCfg = BL_RD_REG(UARTx, UART_DATA_CONFIG);

  if (UART_MSB_FIRST == uartCfg->byteBitInverse) {
    tmpValTxCfg = BL_SET_REG_BIT(tmpValTxCfg, UART_CR_UART_BIT_INV);
  } else {
    tmpValTxCfg = BL_CLR_REG_BIT(tmpValTxCfg, UART_CR_UART_BIT_INV);
  }

  BL_WR_REG(UARTx, UART_DATA_CONFIG, tmpValTxCfg);

  tmpValTxCfg = BL_RD_REG(UARTx, UART_SW_MODE);
  /* Configure rx rts output SW control mode */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_URX_RTS_SW_MODE, uartCfg->rtsSoftwareControl);
  /* Configure tx output SW control mode */
  tmpValTxCfg = BL_SET_REG_BITS_VAL(tmpValTxCfg, UART_CR_UTX_TXD_SW_MODE, uartCfg->txSoftwareControl);
  BL_WR_REG(UARTx, UART_SW_MODE, tmpValTxCfg);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(UART0_IRQn, UART0_IRQHandler);
  Interrupt_Handler_Register(UART1_IRQn, UART1_IRQHandler);
#endif
  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set default value of all registers function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_DeInit(UART_ID_Type uartId) {
  if (UART0_ID == uartId) {
    GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_UART0);
  } else if (UART1_ID == uartId) {
    GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_UART1);
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART configure fifo function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  fifoCfg: FIFO configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_FifoConfig(UART_ID_Type uartId, UART_FifoCfg_Type *fifoCfg) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Deal with uart fifo configure register */
  tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_1);
  /* Configure dma tx fifo threshold */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_TX_FIFO_TH, fifoCfg->txFifoDmaThreshold);
  /* Configure dma rx fifo threshold */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_RX_FIFO_TH, fifoCfg->rxFifoDmaThreshold);
  /* Write back */
  BL_WR_REG(UARTx, UART_FIFO_CONFIG_1, tmpVal);

