Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_uart.c
  /* Enable or disable uart fifo dma function */
  tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

  if (ENABLE == fifoCfg->txFifoDmaEnable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_TX_EN);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_TX_EN);
  }

  if (ENABLE == fifoCfg->rxFifoDmaEnable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_DMA_RX_EN);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_DMA_RX_EN);
  }

  BL_WR_REG(UARTx, UART_FIFO_CONFIG_0, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART configure infra function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  irCfg: IR configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_IrConfig(UART_ID_Type uartId, UART_IrCfg_Type *irCfg) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Configure tx ir mode */
  tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

  if (ENABLE == irCfg->txIrEnable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_EN);
  }

  if (ENABLE == irCfg->txIrInverse) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_IR_INV);
  }

  BL_WR_REG(UARTx, UART_UTX_CONFIG, tmpVal);

  /* Configure rx ir mode */
  tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);

  if (ENABLE == irCfg->rxIrEnable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_EN);
  }

  if (ENABLE == irCfg->rxIrInverse) {
    tmpVal = BL_SET_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, UART_CR_URX_IR_INV);
  }

  BL_WR_REG(UARTx, UART_URX_CONFIG, tmpVal);

  /* Configure tx ir pulse start and stop position */
  BL_WR_REG(UARTx, UART_UTX_IR_POSITION, irCfg->txIrPulseStop << 0x10 | irCfg->txIrPulseStart);

  /* Configure rx ir pulse start position */
  BL_WR_REG(UARTx, UART_URX_IR_POSITION, irCfg->rxIrPulseStart);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Enable UART
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  direct: UART direction type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_Enable(UART_ID_Type uartId, UART_Direction_Type direct) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));
  CHECK_PARAM(IS_UART_DIRECTION_TYPE(direct));

  if (direct == UART_TX || direct == UART_TXRX) {
    /* Enable UART tx unit */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
    BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_EN));
  }

  if (direct == UART_RX || direct == UART_TXRX) {
    /* Enable UART rx unit */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_URX_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  Disable UART
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  direct: UART direction type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_Disable(UART_ID_Type uartId, UART_Direction_Type direct) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));
  CHECK_PARAM(IS_UART_DIRECTION_TYPE(direct));

  if (direct == UART_TX || direct == UART_TXRX) {
    /* Disable UART tx unit */
    tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
    BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_EN));
  }

  if (direct == UART_RX || direct == UART_TXRX) {
    /* Disable UART rx unit */
    tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
    BL_WR_REG(UARTx, UART_URX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set length of tx data transfer,tx end interrupt will assert when this length is
                                                                                *         reached
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  length: Length of data (unit:character/byte)
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetTxDataLength(UART_ID_Type uartId, uint16_t length) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Set length */
  tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);
  BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, UART_CR_UTX_LEN, length - 1));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set length of rx data transfer,rx end interrupt will assert when this length is
                                                                                *         reached
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  length: Length of data (unit:character/byte)
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetRxDataLength(UART_ID_Type uartId, uint16_t length) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Set length */
  tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
  BL_WR_REG(UARTx, UART_URX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_LEN, length - 1));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set rx time-out value for triggering RTO interrupt
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  time: Time-out value (unit:bit time)
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetRxTimeoutValue(UART_ID_Type uartId, uint8_t time) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Set time-out value */
  tmpVal = BL_RD_REG(UARTx, UART_URX_RTO_TIMER);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_RTO_VALUE, time - 1);
  BL_WR_REG(UARTx, UART_URX_RTO_TIMER, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set de-glitch function cycle count value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  deglitchCnt: De-glitch function cycle count
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetDeglitchCount(UART_ID_Type uartId, uint8_t deglitchCnt) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Set count value */
  tmpVal = BL_RD_REG(UARTx, UART_URX_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, UART_CR_URX_DEG_CNT, deglitchCnt);
  BL_WR_REG(UARTx, UART_URX_CONFIG, tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set tx and rx baudrate according to auto baudrate detection value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  autoBaudDet: Choose detection value using codeword 0x55 or start bit
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_ApplyAbrResult(UART_ID_Type uartId, UART_AutoBaudDetection_Type autoBaudDet) {
  uint32_t UARTx = uartAddr[uartId];
  uint16_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

