Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_uart.c
  /* Get detection value */
  tmpVal = UART_GetAutoBaudCount(uartId, autoBaudDet);

  /* Set tx baudrate */
  BL_WR_REG(UARTx, UART_BIT_PRD, tmpVal << 0x10 | tmpVal);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set rx rts output software control value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetRtsValue(UART_ID_Type uartId) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Rts set 1*/
  tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
  BL_WR_REG(UARTx, UART_SW_MODE, BL_SET_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART clear rx rts output software control value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_ClrRtsValue(UART_ID_Type uartId) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Rts clear 0 */
  tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
  BL_WR_REG(UARTx, UART_SW_MODE, BL_CLR_REG_BIT(tmpVal, UART_CR_URX_RTS_SW_VAL));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART set tx output software control value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_SetTxValue(UART_ID_Type uartId) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Tx set 1*/
  tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
  BL_WR_REG(UARTx, UART_SW_MODE, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_TXD_SW_VAL));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART clear tx output software control value
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_ClrTxValue(UART_ID_Type uartId) {
  uint32_t UARTx = uartAddr[uartId];
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Rts clear 0 */
  tmpVal = BL_RD_REG(UARTx, UART_SW_MODE);
  BL_WR_REG(UARTx, UART_SW_MODE, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_TXD_SW_VAL));

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART configure tx free run mode function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  txFreeRun: Enable or disable tx free run mode
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_TxFreeRun(UART_ID_Type uartId, BL_Fun_Type txFreeRun) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

  /* Enable or disable tx free run mode */
  tmpVal = BL_RD_REG(UARTx, UART_UTX_CONFIG);

  if (ENABLE == txFreeRun) {
    BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_SET_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
  } else {
    BL_WR_REG(UARTx, UART_UTX_CONFIG, BL_CLR_REG_BIT(tmpVal, UART_CR_UTX_FRM_EN));
  }

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  UART configure auto baud rate detection function
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  autoBaud: Enable or disable auto function
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type UART_AutoBaudDetection(UART_ID_Type uartId, BL_Fun_Type autoBaud) {
  uint32_t tmpVal = 0;
  uint32_t UARTx  = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));

