Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_uart.c
  if (BL_IS_REG_BIT_SET(tmpVal, UART_STS_URX_BUS_BUSY)) {
    return SET;
  } else {
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Get tx/rx fifo overflow or underflow status
                                                                                *
                                                                                * @param  uartId: UART ID type
                                                                                * @param  overflow: Select tx/rx overflow or underflow
                                                                                *
                                                                                * @return Status of tx/rx fifo
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type UART_GetOverflowStatus(UART_ID_Type uartId, UART_Overflow_Type overflow) {
  uint32_t tmpVal;
  uint32_t UARTx = uartAddr[uartId];

  /* Check the parameters */
  CHECK_PARAM(IS_UART_ID_TYPE(uartId));
  CHECK_PARAM(IS_UART_OVERFLOW_TYPE(overflow));

  /* Get tx/rx fifo overflow or underflow status */
  tmpVal = BL_RD_REG(UARTx, UART_FIFO_CONFIG_0);

  if ((tmpVal & (1U << (overflow + 4))) != 0) {
    return SET;
  } else {
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  UART0 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void UART0_IRQHandler(void) { UART_IntHandler(UART0_ID); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  UART1 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void UART1_IRQHandler(void) { UART_IntHandler(UART1_ID); }
#endif

/*@} end of group UART_Public_Functions */

/*@} end of group UART */

/*@} end of group BL702_Peripheral_Driver */
